Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 512, 512, 3) 0                                            
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 512, 512, 8)  104         input_1[0][0]                    
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 512, 512, 8)  32          conv2d[0][0]                     
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 512, 512, 8)  32          input_1[0][0]                    
__________________________________________________________________________________________________
activation (Activation)         (None, 512, 512, 8)  0           batch_normalization[0][0]        
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 512, 512, 8)  32          conv2d_2[0][0]                   
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 512, 512, 8)  264         activation[0][0]                 
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 512, 512, 8)  0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
add (Add)                       (None, 512, 512, 8)  0           conv2d_1[0][0]                   
                                                                 activation_1[0][0]               
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 512, 512, 8)  32          add[0][0]                        
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 512, 512, 8)  0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 256, 256, 16) 1168        activation_2[0][0]               
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 256, 256, 16) 64          conv2d_3[0][0]                   
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 256, 256, 16) 0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 128, 128, 32) 4640        activation_3[0][0]               
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 128, 128, 32) 128         conv2d_4[0][0]                   
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 128, 128, 32) 0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 64, 64, 64)   18496       activation_4[0][0]               
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 64, 64, 64)   256         conv2d_5[0][0]                   
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 64, 64, 64)   0           batch_normalization_5[0][0]      
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 32, 32, 128)  73856       activation_5[0][0]               
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 32, 32, 128)  512         conv2d_6[0][0]                   
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 32, 32, 128)  0           batch_normalization_6[0][0]      
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 32, 32, 128)  147584      activation_6[0][0]               
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 32, 32, 128)  512         conv2d_7[0][0]                   
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 32, 32, 128)  0           batch_normalization_7[0][0]      
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 32, 32, 128)  147584      activation_7[0][0]               
__________________________________________________________________________________________________
up_sampling2d (UpSampling2D)    (None, 64, 64, 128)  0           conv2d_8[0][0]                   
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 64, 64, 192)  0           up_sampling2d[0][0]              
                                                                 conv2d_5[0][0]                   
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 64, 64, 192)  768         concatenate[0][0]                
__________________________________________________________________________________________________
activation_8 (Activation)       (None, 64, 64, 192)  0           batch_normalization_8[0][0]      
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 64, 64, 128)  221312      activation_8[0][0]               
__________________________________________________________________________________________________
up_sampling2d_1 (UpSampling2D)  (None, 128, 128, 128 0           conv2d_9[0][0]                   
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 128, 128, 160 0           up_sampling2d_1[0][0]            
                                                                 conv2d_4[0][0]                   
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 128, 128, 160 640         concatenate_1[0][0]              
__________________________________________________________________________________________________
activation_9 (Activation)       (None, 128, 128, 160 0           batch_normalization_9[0][0]      
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 128, 128, 64) 92224       activation_9[0][0]               
__________________________________________________________________________________________________
up_sampling2d_2 (UpSampling2D)  (None, 256, 256, 64) 0           conv2d_10[0][0]                  
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 256, 256, 80) 0           up_sampling2d_2[0][0]            
                                                                 conv2d_3[0][0]                   
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 256, 256, 80) 320         concatenate_2[0][0]              
__________________________________________________________________________________________________
activation_10 (Activation)      (None, 256, 256, 80) 0           batch_normalization_10[0][0]     
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 256, 256, 32) 23072       activation_10[0][0]              
__________________________________________________________________________________________________
up_sampling2d_3 (UpSampling2D)  (None, 512, 512, 32) 0           conv2d_11[0][0]                  
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 512, 512, 40) 0           up_sampling2d_3[0][0]            
                                                                 add[0][0]                        
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 512, 512, 40) 160         concatenate_3[0][0]              
__________________________________________________________________________________________________
activation_11 (Activation)      (None, 512, 512, 40) 0           batch_normalization_11[0][0]     
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 512, 512, 16) 5776        activation_11[0][0]              
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 512, 512, 2)  34          conv2d_12[0][0]                  
==================================================================================================
Total params: 739,602
Trainable params: 737,874
Non-trainable params: 1,728
__________________________________________________________________________________________________
